[
  {
    "title": "good",
    "description": "Google continues to be one of the most innovative and reliable tech companies in the world. Its core services—like Google Search, Gmail, Google Maps, and Google Drive—are fast, user-friendly, and consistently updated with new features that improve user",
    "date": "June 2, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "Google"
  },
  {
    "title": "Great progression",
    "description": "Fast paced and not for the unmotivated. but great progression.",
    "date": "June 2, 2025",
    "role": "Account Executive",
    "location": "N/A",
    "company": "Google"
  },
  {
    "title": "a good place to work",
    "description": "This is a great place to work—welcoming atmosphere, modern spaces, and a strong sense of community. Productivity flows naturally thanks to the positive energy and supportive environment.",
    "date": "May 30, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "Google"
  },
  {
    "title": "Topnotch pay and benefits; But it is the bottom line counts most",
    "description": "What I liked: The pay and benefits were great, including time off. I just don't know of any company that is better in this regard. I liked the educational opportunities they provide. I should have taken better advantage of them. I worked remote, but",
    "date": "May 23, 2025",
    "role": "Cyber Security Analyst",
    "location": "Remote",
    "company": "Google"
  },
  {
    "title": "Decent",
    "description": "Decent work culture, supportive team, and exciting projects. Minimal opportunity for growth, but work-life balance can vary by role. Overall decent  employer.",
    "date": "May 12, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "Google"
  },
  {
    "title": "Great work place",
    "description": "Great work place culture!. Everyone is will to help and relate. Great work life balance and scope of work. Top industry compensation across all roles.",
    "date": "May 10, 2025",
    "role": "Product Marketing Manager",
    "location": "Mountain View, CA",
    "company": "Google"
  },
  {
    "title": "Very Nice",
    "description": "Innovative culture, talented colleagues & impactful work. Challenging, but rewarding experience. 5.0/5 stars would abspolutely positively work here again",
    "date": "May 9, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "Google"
  },
  {
    "title": "fun",
    "description": "Great place to work in. benefits are good. Team was nice. No complains. A lot of opportunities for grown and if you have good team, you will enjoy the job like i did.",
    "date": "May 6, 2025",
    "role": "Analyst",
    "location": "N/A",
    "company": "Google"
  },
  {
    "title": "Fun place to work",
    "description": "The management are very supportive. Friendly and smart colleagues. Learning new things everyday. Excellent work life balance. Excellent benefit. Perfect place to be an IC.",
    "date": "May 2, 2025",
    "role": "Software Developer",
    "location": "Toronto",
    "company": "Google"
  },
  {
    "title": "Great place to work at if you have a good manager",
    "description": "Depending on which department you work at, they expect you to raise the bar all the time. Or you could be stuck in a team where there isn't a lot of career growth. How great it is to work there is highly dependent on the manager you have. Peers are",
    "date": "April 27, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "Google"
  },
  {
    "title": "I were a cleaner for 1 month",
    "description": "All the employees were very kind and helpfull with us.",
    "date": "April 27, 2025",
    "role": "Cleaner",
    "location": "Manhattan, NY",
    "company": "Google"
  },
  {
    "title": "Unsatisfied",
    "description": "The current workplace environment lacks meaningful growth opportunities, creating a sense of stagnation and hindering career advancement. Furthermore, communication is often unclear and infrequent, leading to misunderstandings and a lack of engagement.",
    "date": "April 25, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "Google"
  },
  {
    "title": "Good this company is very good and helps the employee in the growth. A very good opportunity for all of the employees to career.",
    "description": "Good this company is very good and helps the employee in the growth. A very good opportunity for all of the employees to career. Overall a very good place to work.",
    "date": "April 25, 2025",
    "role": "SDE Intern",
    "location": "N/A",
    "company": "Google"
  },
  {
    "title": "The best work life, the perks the work life and almost everything is unmatchable.",
    "description": "A typical day at work: I log in early in the morning and check for any new tasks. Then, I wait for the other colleagues to log in and go for breakfast. Between breakfast and lunch, we all try to complete our assigned work. After lunch, we usually chill",
    "date": "April 24, 2025",
    "role": "Senior Digital Media Specialists",
    "location": "India",
    "company": "Google"
  },
  {
    "title": "Fun and Awesome",
    "description": "basically best place that you can hope to work for. The team was great and the pay was even greater. I wish I could be there longer but sadly personal matter lead me to drop this job.",
    "date": "April 23, 2025",
    "role": "IT Technician",
    "location": "N/A",
    "company": "Google"
  },
  {
    "title": "Productive and fun environment",
    "description": "A good work environment fosters creativity, collaboration, and a sense of belonging. It's a space where employees feel valued, respected, and empowered to contribute their best work. Open communication is key, with channels for feedback and ideas flowing",
    "date": "April 22, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "Google"
  },
  {
    "title": "work as a contractor",
    "description": "contractors aren't treated well. Nearly no chance to convert. If you join in order to be converted, good luck. You may see they ended up hiring less experienced new graduate and ask you to train them. But when you tried to compete for this position,",
    "date": "April 18, 2025",
    "role": "Manager",
    "location": "N/A",
    "company": "Google"
  },
  {
    "title": "Google is for Everyone.",
    "description": "Workplace Culture",
    "date": "April 17, 2025",
    "role": "Apprenticeship Project Management Program",
    "location": "New York, NY 10011",
    "company": "Google"
  },
  {
    "title": "Productive",
    "description": "Good salary + benefits, helps you pay for your medical expenses, insurance and travel expenses. Pretty good for someone looking for an entry job and",
    "date": "April 16, 2025",
    "role": "Ceo",
    "location": "Washington",
    "company": "Google"
  },
  {
    "title": "Respectul and honest to personnel",
    "description": "Top Management lived their culture and values of respect, honesty and loyalty on a day-to-day basis, it permeated through the lower ranks as well.",
    "date": "April 15, 2025",
    "role": "HR Generalist",
    "location": "Atlanta, GA",
    "company": "Google"
  }
]