[
  {
    "title": "Great opportunities",
    "description": "Great company. The pay is competitive. The discount is nice also. I wish they would go back to 24 hours. People are utilizing the self check out more.",
    "company": "Walmart"
  },
  {
    "title": "Great benef8ts but horrible co-workers/management",
    "description": "Great PTO but often work was hard due to prior shifts being nothing but teenager's not showing up or working.  Left cause I was threatened to be fired cause we got all our work done but not all the work of the 2nd shift who all called out but a few cashiers and there manager.",
    "company": "Walmart"
  },
  {
    "title": "Fun Workplace",
    "description": "Great staff ! Thy are very understanding and will their best to help you succeed. This is a place that genuinely helps you become a better overall worker",
    "company": "Walmart"
  },
  {
    "title": "Boring and not much too look forward too",
    "description": "I genuinely don't get any enjoyment from working here other than to get paid. Management feels so unsupportive and the whole vibe of the place is just overall dreadful",
    "company": "Walmart"
  },
  {
    "title": "Don't Do It",
    "description": "Not worth the stress for the pay. Management is horrible and they don't care about you. No set schedules and a crazy point system that treats you like you're a child.",
    "company": "Walmart"
  },
  {
    "title": "A lot of work for low pay",
    "description": "Easy job, very little training, and labor intensive at times.  NO accountability, low pay, extra work when other workers are slow and lazy. No incentive on working harder so don't expect anything else but a pat on the back and sub par get-togethers",
    "company": "Walmart"
  },
  {
    "title": "Horrible experience",
    "description": "If you have an issue with people who've been there even a day longer than you, 9 out of 10 times an issue will be ignored by management. It's not a team work environment because everyone is in a race to see how fast they can pick the boots of management.",
    "company": "Walmart"
  },
  {
    "title": "Easy and decent pay",
    "description": "Pretty decent pay, most people were cool there, very chill job but gets busy from time to time along with some stupid customers but other then that a good job for teenagers",
    "company": "Walmart"
  },
  {
    "title": "Shyteee",
    "description": "Bad. All my coworkers sucked, managers never listen to you, good luck getting time off doesn't let you call out/you get a point (even  if you were in the hospital)",
    "company": "Walmart"
  },
  {
    "title": "Not bad to work for",
    "description": "My coworker's were great and most of the management team was good too. There were times I did feel like expectations were not realistic, overall I did like the job and who I worked with.  Customers could be difficult at times, but everyone gets frustrated from time to time.",
    "company": "Walmart"
  },
  {
    "title": "Chaotic but pays decent",
    "description": "Easy job overall, but management is very inconsistent. They frequently change how they like to do things which can be confusing. Walmart has a lot of employees, so if you are a social person you will make lots of friends!",
    "company": "Walmart"
  },
  {
    "title": "Not great long term",
    "description": "The management is terrible and won’t take any of your concerns seriously. Just be prepared to see at lot of favoritism and mistreatment happen. The pay is okay but I don’t know if it’s worth it to  stick around for too long, they do have benefits but they’re average at best.",
    "company": "Walmart"
  },
  {
    "title": "Terrible place to work",
    "description": "Walmart is a terrible place to work. There is favoritism and too much drama. Some of the supervisors are very nasty. No matter how hard you work they always find something to criticize. The pay is way too low for the amount of time you are on your feet.",
    "company": "Walmart"
  },
  {
    "title": "Amazing Management",
    "description": "good job, people were nice and amazing. Never had any problems with coworkers and would recommend this job to anyone needing fast cash in college! Had really nice bosses.",
    "company": "Walmart"
  },
  {
    "title": "Decent pay and fast pace work",
    "description": "Easy job not bad, good pay. Go in and then be assigned to certain area. Stock and then bin over stock. After go help another isle and then zone for the rest of the shift",
    "company": "Walmart"
  },
  {
    "title": "You will hate it",
    "description": "they need to have better management an treat employees better then they do they don't care about there employees at all an they don't want to give u hours an they also keep u part time so they don't have to pay u the full benefits they offer ur lucky",
    "company": "Walmart"
  },
  {
    "title": "A great place to work, am trying to get hired at the walmart in enterprise alabama",
    "description": "What is the best part of working at the company?",
    "company": "Walmart"
  },
  {
    "title": "My Walmart experience",
    "description": "Walmart is a good place to work the company itself is not bad nor is the workers. Although the managers are on a power trip and abuses their power and take advantage of their hard working employees. They overwork the employees without giving a raise",
    "company": "Walmart"
  },
  {
    "title": "Good",
    "description": "Walmart good gives benefits when they let you work the required hours. Also you can just chitchat all day. Super nice to be able to talk to people too.",
    "company": "Walmart"
  },
  {
    "title": "worst job ever",
    "description": "took me off the schedule for two months randomly put me back on. management were pedos and dated my minor friend for extra hours. really crazy how this worked",
    "company": "Walmart"
  },
  {
    "title": "Dont",
    "description": "overall not the best place to work, they do not care about you, they care about statistics and making sure they look good on paper. Even if it means degrading their workers and over working them, making them perform tasks not in the job description.",
    "company": "Walmart"
  }
]