[
  {
    "title": "Working at Adidas felt like working at several different places and was a daily exercise in contridictions.",
    "description": "What is the best part of working at the company?",
    "date": "June 18, 2025",
    "role": "Warehouse Worker",
    "location": "N/A",
    "company": "adidas"
  },
  {
    "title": "Fun place to work",
    "description": "Fun place to work. Easy going environment. Good quality products with discount for the employees. Funny colleagues.",
    "date": "June 17, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "adidas"
  },
  {
    "title": "Fun but tiresome",
    "description": "Working in the back-of-house department at Adidas was a fun experience most of the time. The team often kept each other motivated, and there was a sense of support during busy shifts. A lot of us became close, which helped with communication and teamwork.",
    "date": "June 13, 2025",
    "role": "Retail Sales Associate",
    "location": "Camarillo, CA",
    "company": "adidas"
  },
  {
    "title": "Fun place",
    "description": "Fun place to work, easy to learn, great team, good pay, great. Employee benefits and flexible for students, offer part and full time as well, scheduling is not bad",
    "date": "June 12, 2025",
    "role": "Cashier",
    "location": "Gurnee, IL",
    "company": "adidas"
  },
  {
    "title": "Boring but customers save the day",
    "description": "Yeah thats right",
    "date": "June 3, 2025",
    "role": "Salesman",
    "location": "N/A",
    "company": "adidas"
  },
  {
    "title": "It was okay",
    "description": "Overworked and underpaid. It's always something at this place. Would complete the other shifts work, just because they wanted to. But always got popped",
    "date": "June 2, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "adidas"
  },
  {
    "title": "If there isn't anything better for you to do",
    "description": "I worked 3 12 hour shifts. It was brutal. These people DO NOT care about you. Management has no idea what's happening. I was there 6 weeks people! The people I worked with were great though but that's about it. The whole company left a bad taste in my mouth.",
    "date": "May 29, 2025",
    "role": "Residual Line Loader",
    "location": "Spartanburg, SC",
    "company": "adidas"
  },
  {
    "title": "Solid Atmosphere for Retail",
    "description": "Working at adidas was a fun experience overall—great team atmosphere and always plenty to do. But the pay didn’t match the workload, and management could be inconsiderate with time off and how they treat employees at times.",
    "date": "May 27, 2025",
    "role": "Retail Sales Associate",
    "location": "Sunrise, FL",
    "company": "adidas"
  },
  {
    "title": "Great Job",
    "description": "Overall, a really Good place to work. Most of the people are friendly. Most of management is supportive and fair. If there is a \"worst part it's the 12hr shifts.",
    "date": "May 25, 2025",
    "role": "Screen Print Specialist",
    "location": "Indianapolis, IN",
    "company": "adidas"
  },
  {
    "title": "fun workplace",
    "description": "It was great working, everyone in the team connects very well and work expectations are reasonable, nothing too crazy. Would definitely recommend to work here",
    "date": "May 21, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "adidas"
  },
  {
    "title": "Great low stress job",
    "description": "Pretty easy work and the employee discount rocks. Ample opportunity to move up in store if you’re a good worker. Hours are plentiful when during peak shopping seasons too.",
    "date": "May 16, 2025",
    "role": "Stock",
    "location": "N/A",
    "company": "adidas"
  },
  {
    "title": "Grupo adecuado",
    "description": "Los compañeros de trabajo y el ambiente de trabajo es ideal",
    "date": "May 1, 2025",
    "role": "Anonymous",
    "location": "Málaga, España",
    "company": "adidas"
  },
  {
    "title": "Dissatisfied",
    "description": "I don’t believe I learned much besides what I have already learned from other businesses I have worked for before. I had my fair share of issues with the job and I realized that with my own personal condition and due to other factors as well that this",
    "date": "April 17, 2025",
    "role": "Sales Associate",
    "location": "N/A",
    "company": "adidas"
  },
  {
    "title": "Fun",
    "description": "It’s fun, good beginner high school job, good pay and good experiences would recommend for anyone looking for a first job, nice benefits and discounts",
    "date": "April 9, 2025",
    "role": "Seasonal Sales Associate",
    "location": "Woodburn, OR",
    "company": "adidas"
  },
  {
    "title": "Fired after 3 weeks",
    "description": "I loved what I did at this job. But after working for 3 weeks straight, they FIRED ME and my hubby for our backgrounds. If you have a background DONT take the job. They will let u work, then fire u later.",
    "date": "April 7, 2025",
    "role": "Forklift Operator",
    "location": "Spartanburg, SC",
    "company": "adidas"
  },
  {
    "title": "Worked here in Covid",
    "description": "They fired me without notice during  Covid 19 and I was not able to get a job or file unemployment they do not care about their works I did not enjoy it here",
    "date": "April 5, 2025",
    "role": "Sales Manager",
    "location": "Atlanta, GA",
    "company": "adidas"
  },
  {
    "title": "Ok company to work for",
    "description": "Leadership doesn't see people as people. HR is very pro-company and can't be bothered to listen to actual problems within the company. Also, the temp company they use will put anybody that's breathing in there regardless if they can do the job or not.",
    "date": "April 3, 2025",
    "role": "Warehouse Worker",
    "location": "Wilkes-Barre, PA",
    "company": "adidas"
  },
  {
    "title": "Great benefits, great hours.",
    "description": "Great place to work in my opinion but I had to leave because I can't stand working at a specific rate and standing in one place all day everyday...,..",
    "date": "April 2, 2025",
    "role": "Packing",
    "location": "Wilkes-Barre, PA",
    "company": "adidas"
  },
  {
    "title": "very good company",
    "description": "I learnt a lot here. My supervisor and colleagues are really supportive. There are discounts for employees. Good start for someone who want to be in apparel industry",
    "date": "March 31, 2025",
    "role": "Intern",
    "location": "N/A",
    "company": "adidas"
  },
  {
    "title": "Terrible Place to Work",
    "description": "The place is just miserable and management is no better.  This is the first time I have worked in a place and they take your job away from you and throw you on a production line to work like a dog . The hours are long and you are on your feet the whole",
    "date": "March 28, 2025",
    "role": "Warehouse Worker",
    "location": "dc1 spartanburg sc",
    "company": "adidas"
  }
]