[
  {
    "title": "Horrible",
    "description": "You have to work through very fast and unorganized bosses and ultimately it hinders your overall experience . I would definitely recommend only staying 1 year",
    "date": "June 19, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Not fun",
    "description": "People there suck like really suck. No supportive teams. It’s everyone for themselves l. Adults there act like children and never take responsibility for simple mishaps.",
    "date": "June 19, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Flexible and nice coworkers",
    "description": "It's retail, but working part time is okay and lots of flexibility. Customers can be annoying but that's expected. Definitely gained great customer service experience",
    "date": "June 19, 2025",
    "role": "Style Consultant",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Good retail work, compared to others",
    "description": "Its a retail job, with all the baggage that comes with it. The structure and duties are very standardized from store to store so it really comes down to who your coworkers and managers are. My team worked very well together, but the job itself is very",
    "date": "June 19, 2025",
    "role": "Team Member",
    "location": "Virginia",
    "company": "target"
  },
  {
    "title": "Ups and downs",
    "description": "The people I worked with were varied and amazing. Very helpful and kind. The corporate side of things were about as bs and idiotic as you'd expect a corporation with no experience doing the day to day work to be.",
    "date": "June 19, 2025",
    "role": "Fulfillment Expert",
    "location": "Bristol, VA",
    "company": "target"
  },
  {
    "title": "Good Work, semi-okay management",
    "description": "Sometimes the management need a check up. 7 months I worked there and most of the time it was us trying to fend for ourselves because the management wasn't there to assist. The co workers and work was easy and nice. Very good work environment once you make friends",
    "date": "June 19, 2025",
    "role": "Barista",
    "location": "Cape Coral, FL",
    "company": "target"
  },
  {
    "title": "lots of changes but flexible schedule",
    "description": "I liked that i could have a flexible schedule, but policy changes were happening all the time, it was hard to keep up. Besides that it was a pretty good place to work if you like retail and customer service.",
    "date": "June 18, 2025",
    "role": "Style Consultant",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Fun but stressful",
    "description": "It was a good place to work for at first. But as I got more into the job, I noticed they had cliques. There was also a lot of favoritism. The job itself wasn’t hard, but managers were arrogant.",
    "date": "June 18, 2025",
    "role": "Fulfillment Expert",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Decent job for working retail",
    "description": "It's a retail entry level job. Pay is average, work isn't too hard, sometimes  they expect to much before closing time. Some managers are good but  most don't do anything and just sit around while you do all the work.",
    "date": "June 18, 2025",
    "role": "Food and Beverage Expert",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Understaffed and poor managed",
    "description": "While some of the management is great, a good majority are unorganized and immature. Often are forced to work with no help and are ignored by management. Positions are great, but work environment is often lacking and only few people will actually listen and do something about your complaints.",
    "date": "June 18, 2025",
    "role": "Barista/Sales Associate",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Always understaffed",
    "description": "It’s not a toxic work environment as employees are actually kind to one another in my experience but the store is always understaffed. Be prepared to do the job of 5 associates in one shift and always have your hours cut.",
    "date": "June 18, 2025",
    "role": "Beauty Consultant",
    "location": "New York, NY",
    "company": "target"
  },
  {
    "title": "Not worth it",
    "description": "Start day early. End the day most times with in 5 or less hours because the won’t give you more hours. Some of the management I would give huge kudos for, others not so much. When you get threatened with physical violence it’s time to end the relationship",
    "date": "June 18, 2025",
    "role": "Pricing/Cashier/DBO Dedicated Business Owner",
    "location": "Clifton Park, NY",
    "company": "target"
  },
  {
    "title": "Great environment",
    "description": "It was such an amazing and life changing experience I’ve met a lot of awesome coworkers. The environment feels so different from other jobs. More friendly for coworkers with disabilities.",
    "date": "June 18, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Overworked",
    "description": "Over worked and under appreciated. Target bases their hours available for team members based on previous year sales at the same time. We have been getting slammed with freight coming I  and no hours to work itso everyone is exhausted.",
    "date": "June 18, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "It’s okay",
    "description": "Nothing much to complain except hope you get good management and the job will be smooth. It’s nothing that’ll get you absolutely tired after working a long shift",
    "date": "June 18, 2025",
    "role": "General Merchandise Expert",
    "location": "Bridgewater, NJ",
    "company": "target"
  },
  {
    "title": "Great entry level",
    "description": "Great entry level job. The pay is good starting out and their scheduling is very flexible. I love the people i work with. If you're okay with retail, this is a good place to start.",
    "date": "June 18, 2025",
    "role": "Fulfillment Captain",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Target became worse over time",
    "description": "I was promoted into several different roles over the course of several years and it was a great place to work while still in college. Once I graduated, and was promoted into a team lead position, everything fell apart. The workload was impossible, team",
    "date": "June 18, 2025",
    "role": "Consumables Team Leader",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "fun workplace!",
    "description": "working at Target has been a largely positive experience, especially for those seeking a fast-paced and team-oriented environment. The company emphasizes a strong sense of community among employees, and team leads are generally approachable and supportive.",
    "date": "June 18, 2025",
    "role": "Cashier",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Really Depends on your co-workers",
    "description": "The job was OK for the most part, but it can get pretty hectic at times. Especially on the weekends. Overall I would recommend the job for anyone starting out in their job career.",
    "date": "June 18, 2025",
    "role": "Guest Associate",
    "location": "Chesapeake, VA",
    "company": "target"
  },
  {
    "title": "Okay",
    "description": "Managers could do better. always short staffed.pay not worth it for all the work that you do. Target could definitely pay their workers better. 40 hours one week and 20 the next",
    "date": "June 18, 2025",
    "role": "Guest Advocate",
    "location": "N/A",
    "company": "target"
  }
]