[
  {
    "title": "Great Place to work",
    "description": "What can I say I absolutely love this place, The hours, benefits, the pay, the generous amount of vacation time the company gives, the Nike discount, great  people to work with that are very helpful and polite. And the 4/10 schedule is awesome you get",
    "date": "June 17, 2025",
    "role": "Equipment Operator II",
    "location": "Lake Forest, CA",
    "company": "nike"
  },
  {
    "title": "Nike",
    "description": "Great company, but be aware of certain members of the management teams. Corporate should do more to cleanse their DC’s , especially the ones located in Memphis, TN.",
    "date": "June 16, 2025",
    "role": "PMV operator",
    "location": "Memphis, TN",
    "company": "nike"
  },
  {
    "title": "Great pay but difficult work",
    "description": "The pay is great for what the job is (starts at $15.50/hr), but the hours are long and the work can be demanding. Shifts last nine hours (eight working, one lunch) and you'll be on your feet any time you're not on break. However, there's a strong work",
    "date": "June 16, 2025",
    "role": "Sales Associate",
    "location": "Edinburgh, IN",
    "company": "nike"
  },
  {
    "title": "Work from home",
    "description": "Opportunity to work from home income if needed extra money if you’re looking for flexibility not much room to grow in n the company but great for the extra income",
    "date": "June 16, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "nike"
  },
  {
    "title": "Productive",
    "description": "More Than Just Sneakers: A Nike Store Experience!",
    "date": "June 15, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "nike"
  },
  {
    "title": "Fast-Paced and Team-Oriented Work Environment",
    "description": "Working as a Sales Associate at the Nike Factory Store in Kittery, Maine offers a dynamic and energetic atmosphere, especially during tourist seasons. The pace is fast, and there’s always something to do from restocking inventory and organizing displays",
    "date": "June 12, 2025",
    "role": "Sales Associate",
    "location": "Kittery, ME",
    "company": "nike"
  },
  {
    "title": "Cool but a lot of favoritism",
    "description": "Managers talk bad behind peoples back.  Favoritism is shown through who gets hours, etc.  It is a chill place to work at but honestly no room for advancement unless your on the list of favoritism",
    "date": "June 12, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "nike"
  },
  {
    "title": "Work place",
    "description": "I’ve had a consistently positive experience with Alpro . The staff is knowledgeable, friendly, and always willing to go the extra mile to answer questions or provide advice about medications. Their prescription filling process is efficient, and I rarely",
    "date": "June 11, 2025",
    "role": "Retail Sales Associate",
    "location": "Welaka, FL",
    "company": "nike"
  },
  {
    "title": "Fun workplace",
    "description": "Had a good time , staffing is good. The times are flexible and manageable. I prefer to not be late. Discounts on clothes. Location was great. Short break time",
    "date": "June 10, 2025",
    "role": "Stock Associate",
    "location": "N/A",
    "company": "nike"
  },
  {
    "title": "Fun workplace with some drawbacks",
    "description": "It’s customer service, so can’t expect the best work environment everyday when dealing with the general public. However, overall enjoyed my co-workers and work environment.",
    "date": "June 10, 2025",
    "role": "Administrative Assistant",
    "location": "Las Vegas, NV",
    "company": "nike"
  },
  {
    "title": "Fun workplace",
    "description": "It was okay we would have company picnics and trips to amusement parks. We would have Christmas parties and Holiday bonuses and quarterly bonuses as well",
    "date": "June 10, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "nike"
  },
  {
    "title": "Speak up but nothing will change.",
    "description": "The work environment was challenging due to frequent drama and a lack of genuine teamwork. While some employees acted like part of a team, many were spreading rumors and gossiping behind others' backs. Favoritism was also a concern—certain coaches often",
    "date": "June 9, 2025",
    "role": "Sales Associate",
    "location": "Texas",
    "company": "nike"
  },
  {
    "title": "Favoritism played a lot of factors within management. Little to no advancement within leadership chain and within the store overall.",
    "description": "Discounts were awesome. Nikes values deteriorated as they tried coming out at “woke”. Management played favoritism a lot. Met some great people, met others who had it out for anyone for drama. Nike, hire people based off actual skill, development, and",
    "date": "June 5, 2025",
    "role": "Team Leader",
    "location": "Texas",
    "company": "nike"
  },
  {
    "title": "Good company with bad accountability",
    "description": "Nike is a good company with great benefits. The PTO, ESPP, parental leave and well being are all great. However, the part time associates abuse the benefits to get closer to their life time discount. Associates will be out of work for months at a time.",
    "date": "June 4, 2025",
    "role": "Coach",
    "location": "N/A",
    "company": "nike"
  },
  {
    "title": "Laid back in the back, uptight in the front.",
    "description": "I mostly worked in the stockroom where, as long as you hit productivity goals and don’t call out more than once a month, you’re in the green. In the front, the pressure is on to smile and greet customers as well as sign them up for Nike accounts. If",
    "date": "June 3, 2025",
    "role": "Athlete (Sales Associate)",
    "location": "Flushing, NY",
    "company": "nike"
  },
  {
    "title": "Lovley",
    "description": "Great company to work for.There is a lot to learn. Wonderful culture. The benefits are amazing. Plenty of room to advance.",
    "date": "June 3, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "nike"
  },
  {
    "title": "cool place",
    "description": "good benefits. loved working here during my time. Great co workers.  Had to relocate due to school. Reccommend. You learn a lot here. Great leadership.",
    "date": "June 2, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "nike"
  },
  {
    "title": "Productive and fun workplace",
    "description": "This job is the best place to work in the entire world. If you’re thinking about working for them. Just do it. If your into sports and athletics this is the spot to work",
    "date": "June 2, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "nike"
  },
  {
    "title": "Great culture",
    "description": "Loved working here. It's hard work for retail, very busy store, but the people and the culture are a great environment. The managers hold you accountable to what Nike wants but they're all nice people and are encouraging you to go after your goals.",
    "date": "June 2, 2025",
    "role": "Sales Associate",
    "location": "Camarillo, CA",
    "company": "nike"
  },
  {
    "title": "Good discount, fair pay",
    "description": "A bit cliquey but overall had a great discount and fairly flexible work hours. It was a decent job for a student due to the nights and weekends available.",
    "date": "June 1, 2025",
    "role": "Sales Associate",
    "location": "N/A",
    "company": "nike"
  }
]