[
  {
    "title": "Amazing fun workplace",
    "description": "Working at Gap clothing store offers a dynamic retail experience focused on customer service, teamwork, and fashion. Employees typically handle tasks like greeting customers, restocking merchandise, processing transactions, and maintaining visual standards.",
    "date": "June 16, 2025",
    "role": "Sales Associate",
    "location": "N/A",
    "company": "gap"
  },
  {
    "title": "Great place to work.",
    "description": "Fun, exciting environment with great peers and cross divisional partnerships. It's a one for all and all for one. Everyone supports one another and pushes one another to grow. Many confusing decisions ultimately cost the company, as the mindset of being",
    "date": "June 10, 2025",
    "role": "Sr. Manager, Operations",
    "location": "San Francisco, CA",
    "company": "gap"
  },
  {
    "title": "Very satisfied",
    "description": "Great team environment. Motivational and positive. I met a lot of great people and management was always uplifting and helpful trying to help us reach our targets.",
    "date": "June 8, 2025",
    "role": "Sales Associate",
    "location": "N/A",
    "company": "gap"
  },
  {
    "title": "As expected",
    "description": "Work was as you would imagine hours restocking items and refolding items. Assisting customers that come in all forms, some rude and some nice. Some days were better than others",
    "date": "June 6, 2025",
    "role": "Sales Associate",
    "location": "New York, NY",
    "company": "gap"
  },
  {
    "title": "Great Management",
    "description": "Great place to work when you have a good team and management who set a great workplace culture. I have worked with other managers at Gap that make the job stressful but my current one is amazing",
    "date": "June 4, 2025",
    "role": "Sales Associate",
    "location": "N/A",
    "company": "gap"
  },
  {
    "title": "A fairly ok temp or in-between job",
    "description": "If you are confident in your ability to hustle credit cards that most people don't want then go for this job while between opportunities. If you doubt your ability to get 5 new cardholders a week then don't bother. They'll play it off week one but by",
    "date": "May 29, 2025",
    "role": "Customer Service Team",
    "location": "Puyallup, WA",
    "company": "gap"
  },
  {
    "title": "depends on management",
    "description": "Got lucky with good management so my time at Gap was good. Demographic is what you think - middle aged moms and grandmas looking for clothes for themselves and kids. Guys looking for work clothes. The discount is pretty good but clothes are pretty expensive",
    "date": "May 25, 2025",
    "role": "Sales Associate",
    "location": "N/A",
    "company": "gap"
  },
  {
    "title": "Pays mid but overall lightweight job",
    "description": "In one year I hadn't gotten a pay raise despite picking up more jobs around the workplace, the jobs are easy for most people but cashiering requires a training",
    "date": "May 23, 2025",
    "role": "Sales Associate/Cashier/Customer Service",
    "location": "N/A",
    "company": "gap"
  },
  {
    "title": "Simple and clear expectations.",
    "description": "Fine job, great entry level retail job. Pay varies based on location and manager. Expect to state desired pay during interviews. They will try to undersell you. Can be rough being on your feet for long periods but overall fine.",
    "date": "May 21, 2025",
    "role": "Retail Associate",
    "location": "N/A",
    "company": "gap"
  },
  {
    "title": "Amazing",
    "description": "Gap is an amazing place to work! Supportive team, great leadership, and a fast-paced environment that keeps you engaged. Growth opportunities abound!!",
    "date": "May 14, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "gap"
  },
  {
    "title": "What you would  expect from a reatail env",
    "description": "I worked there for a couple of months because they won't work around your schedule. It's everything you would expect; I was lucky enough to get good supervisors, co-workers are a hit or miss, and mine were terrible.",
    "date": "May 13, 2025",
    "role": "Sales Associate",
    "location": "New York, NY",
    "company": "gap"
  },
  {
    "title": "Was cool while it lasted,  very flexible and accomodating for uni students.",
    "description": "This company helped me gain lots of knowledge of everything there is to know about retail over my tenure. I reccomend this for a job that will give you that experience needed to get better jobs down the road.",
    "date": "May 6, 2025",
    "role": "Sales Associate",
    "location": "N/A",
    "company": "gap"
  },
  {
    "title": "Easy work but slow sometimes",
    "description": "The work is pretty easy and the management for the most part is nice. During peak it’s nice hours and nice pay. After peak it goes down hill on hours.",
    "date": "May 5, 2025",
    "role": "Warehouse Worker",
    "location": "Fresno, CA",
    "company": "gap"
  },
  {
    "title": "Fun",
    "description": "Fun to work more like a family",
    "date": "May 1, 2025",
    "role": "Sales Associate",
    "location": "Norwich, CT",
    "company": "gap"
  },
  {
    "title": "Great experience",
    "description": "Loved working here great benefits, management and job the make sure you’re full trained and are always there to help ! Great health benefits and perks",
    "date": "May 1, 2025",
    "role": "Customer Support Specialist",
    "location": "Groveport, OH",
    "company": "gap"
  },
  {
    "title": "good first experience",
    "description": "Started working here a few years ago and it is a good first job experience to learn the basics of working. I was a sales associate and worked the cash register. only downside was expectations to ope. up credit cards.",
    "date": "April 29, 2025",
    "role": "Anonymous",
    "location": "Woodbridge, VA",
    "company": "gap"
  },
  {
    "title": "Normal retail job",
    "description": "Pay is minimum wage,  but aside from that, it's your average retail job.  Management was great.",
    "date": "April 24, 2025",
    "role": "Sales Associate",
    "location": "Savannah, GA",
    "company": "gap"
  },
  {
    "title": "Easy Work",
    "description": "Depending what position you have a workday can be easy as playing uno. Picking is usually where you start, once you advance there you get incentives and options to be crossed trained faster. They faster you learn the more incentives you can make. You",
    "date": "April 24, 2025",
    "role": "Merchandise Handler",
    "location": "Phoenix, AZ",
    "company": "gap"
  },
  {
    "title": "Straightforward",
    "description": "The work is pretty straightforward, ring people up, restock the floor with clothes, organize the store. Although it can pile up and costumers can be annoying. I assume it’s the same at any other retail though.  Some managers are strict while others are very chill.",
    "date": "April 23, 2025",
    "role": "Associate",
    "location": "N/A",
    "company": "gap"
  },
  {
    "title": "Productive fun",
    "description": "Friendly environment staff kids were fun to work with customers were a joy management was pretty good love having the sales and working with new product",
    "date": "April 22, 2025",
    "role": "Associate",
    "location": "N/A",
    "company": "gap"
  }
]