[
  {
    "title": "Welcoming, Poor Hours.",
    "description": "Other employees were friendly. If you are assertive managers, will usually help you with your needs. The scheduling managers will overstep if you let them. Otherwise, it was good but humbling experience.",
    "date": "July 24, 2025",
    "role": "Customer Service Representative",
    "location": "Moorhead, MN",
    "company": "target"
  },
  {
    "title": "Great place to start out your career",
    "description": "Coworkers were great and made it enjoyable going to work but management is poor. Can gain experience by being open to working and learning different areas learning new tasks. Not the worst place to work if you can tolerate management.",
    "date": "July 24, 2025",
    "role": "Tech Consultant",
    "location": "Duarte, CA",
    "company": "target"
  },
  {
    "title": "horrible management",
    "description": "I had a bacterial infection, and I needed to stay at home and rest for a few days. I was fired for calling in sick.",
    "date": "July 24, 2025",
    "role": "Stocker",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Style consultant",
    "description": "Wasn’t hard to do but as a style consultant you were constantly pulled in every department for back up. Very fast paced if you like that. The girls in my department make everyday better",
    "date": "July 24, 2025",
    "role": "Style Consultant",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Very fun",
    "description": "I enjoyed Target a lot. I would recommend it to anyone looking for a job. I was so happy to go to work and help all the customers. Overall, my experience at target was very positive",
    "date": "July 24, 2025",
    "role": "Cashier",
    "location": "Lake Worth, FL",
    "company": "target"
  },
  {
    "title": "awful",
    "description": "Manager micromanaged everything and kept checking on you everytime he made his rounds which was 24/7. No support and not a lot of training. HR was useless and unhelpful to accommodate.",
    "date": "July 23, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Terrible Managenent",
    "description": "Management is terrible except maybe one or two, place is out of order, company is failing, they cut hours out of nowhere then promise you you’ll get them back next week. Try to give you a heavy work load and a time limit while they walk around pretending to stress.",
    "date": "July 23, 2025",
    "role": "Inbound Expert",
    "location": "Murfreesboro, TN",
    "company": "target"
  },
  {
    "title": "Fast paced",
    "description": "overall not bad, good environment and structured work. Easy entry level job if your looking for somewhere to work on the weekends or through the week with balancing school.",
    "date": "July 23, 2025",
    "role": "Sales Associate",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Always Working",
    "description": "Was good to work at, friendly coworkers and team leaders. Long break. Sometimes would have to work overtime. Sometimes there were miscommunications but overall pretty good.",
    "date": "July 23, 2025",
    "role": "Associate",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Cool place to work",
    "description": "This place has the opportunity for tons of overtime if that's what you like.  The people are cool to work with and the management is supercalifrigelistically easy to get along with.",
    "date": "July 23, 2025",
    "role": "Maintenance Technician",
    "location": "Lansing, MI",
    "company": "target"
  },
  {
    "title": "“Too many cooks in The kitchen”",
    "description": "The training you get is very minimal, and your speed gets compared to workers who’ve been there for years. Calling in late/off work is fairly easy to do on the app. Team leaders don’t communicate well with each other, so be prepared to be given a task",
    "date": "July 23, 2025",
    "role": "Inbound Sales Representative",
    "location": "San Diego, CA",
    "company": "target"
  },
  {
    "title": "Fun",
    "description": "I loved working here it was a great Job to work at if you’re looking for a fun place to work things the job for you the people and the hours are great",
    "date": "July 23, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Caution.",
    "description": "I currently work as a Barista in the Starbucks section of Target. I highly advise if you are seeking out the same, to look elsewhere. There are no shift leaders/supervisors. No play callers. Also, tipping is not allowed, as it is considered \"solicitation\"",
    "date": "July 23, 2025",
    "role": "Barista",
    "location": "1717 Olentangy River Road",
    "company": "target"
  },
  {
    "title": "Fun for college students",
    "description": "I had a good experience overall. Decent pay and flexible hours. Made friends, good managersd. Better if you can get trained in multiple depts.",
    "date": "July 23, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Not easy",
    "description": "When I first started working at Target, I really enjoyed the job and the environment felt positive. Over time, things began to change and I started to feel less motivated. The managers don’t offer much support or communication, and it’s hard to feel",
    "date": "July 23, 2025",
    "role": "Guest Service Advocate",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Fun workplace",
    "description": "Target has a diverse team culture, experienced leaders and competitive pay, only downside is it’s always busy but other than that target is a great place to work",
    "date": "July 23, 2025",
    "role": "GSA",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Can be stressful at times",
    "description": "When you are able to be in your zone and the work load is not too crazy it is fine. But when you have to do multiple other jobs it can be very stressful.",
    "date": "July 23, 2025",
    "role": "Style Consultant",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Good place to work",
    "description": "Not much to say. Supportive management and a positive environment with an overall a good experience with helpful leadership and clear communication throughout my time there.",
    "date": "July 23, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "I would like to return part time if I could get to the website I can get to the website",
    "description": "I would like to return.I Loved the people I worked with .I have nothing else to say . Ready to work again.Don't know what is taking so long to rehire me.The Store was well maintained",
    "date": "July 23, 2025",
    "role": "Stocker",
    "location": "Pensacola, FL",
    "company": "target"
  },
  {
    "title": "In between",
    "description": "I had an amazing time sometimes, but other times I was frustrated with management because they were either too busy or didn’t understand my concerns. But it is a good job to have for the time being",
    "date": "July 22, 2025",
    "role": "Stocker",
    "location": "N/A",
    "company": "target"
  }
]