[
  {
    "title": "it's just target",
    "description": "Your bosses will be pressuring you to meet unrealistic expectations. Yes, it's important to put in effort. No, minor mistakes should not be treated as if the earth is literally crumbling in on itself. If you don't let it get to you, it's fine. But God some people need a reality check",
    "date": "June 17, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Disappointing",
    "description": "Position On demand guest advocate. It seems like a good idea. Allow,  the advocates that are not on demand  to request or call off easier  and allow some to pick up those shifts. However, Its quite competitive to get shifts.   The training was sabotaged",
    "date": "June 17, 2025",
    "role": "On Demand guest advocate",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "They pick and choose when to do their job",
    "description": "When I first started I was pretty chill. But when new management came and switch everything up, it became a awful, chaotic and messy. People there are so toxic and management pick when and who they enforce there rules upon. Always asking you to stay",
    "date": "June 17, 2025",
    "role": "Team Member",
    "location": "Houston, TX",
    "company": "target"
  },
  {
    "title": "Overall toxic workplace",
    "description": "Unrealistic expectations of employees, managers and coworkers that gossip like high schoolers, aggressive management and lack of understand for your personal circumstances",
    "date": "June 17, 2025",
    "role": "Seasonal Employee",
    "location": "San Antonio, TX",
    "company": "target"
  },
  {
    "title": "Soleless",
    "description": "Felt pretty sole less working there. No sense of purpose and basically just had to move massive fixtures to random locations based off of what corporate said. Management was not understanding of workers circumstances and seemed just as sole less as corporate.",
    "date": "June 17, 2025",
    "role": "Remodeling Crew",
    "location": "Culpeper, VA",
    "company": "target"
  },
  {
    "title": "okay",
    "description": "managers a little bit hard but it was a good place to work good pay was glad to have worked there was better than walmart than i would say just had to move away would work again",
    "date": "June 17, 2025",
    "role": "Cashier",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Good Starting Job",
    "description": "The people were always friendly and easy to talk to and ask for advice. Schedules were accommodating and were only busy during holiday periods. Would recommend.",
    "date": "June 17, 2025",
    "role": "Cashier/Sales Associate",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Easy going",
    "description": "Working at Target was fairly easy, though it was underpaid and difficult to get full time hours if that's what you are looking for. My team leads were great to work with",
    "date": "June 17, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Okay",
    "description": "Schedule could be improved as there are a lot of moments where you will be alone. The work is not too hard but can be very busy at times. Overall, the job is easy and the pay isn't too bad.",
    "date": "June 17, 2025",
    "role": "Barista",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Not as great as you think!!",
    "description": "What is the best part of working at the company?",
    "date": "June 17, 2025",
    "role": "Pacesetter",
    "location": "Fort Worth, TX",
    "company": "target"
  },
  {
    "title": "Great place to work",
    "description": "Besides the angry customers management  is really good. Would recommend to anyone trying to get a start in customer service. The associates are cool people",
    "date": "June 17, 2025",
    "role": "Sales Associate",
    "location": "Valley Stream, NY",
    "company": "target"
  },
  {
    "title": "Good hard work",
    "description": "Day to day the work would change. I enjoyed putting out all the new items and ensuring people had a nice place to shop. Got to go home at the end of the day feeling like I worked hard.",
    "date": "June 16, 2025",
    "role": "Stocker",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Ok",
    "description": "Okay pay but if they ever train you to work in Fullfillment, that’s all you’ll be scheduled to do. Full timers get priority over part timers that have been with the company forever. certain bias over departments such as specialty sales not being taken seriously as other ones.",
    "date": "June 16, 2025",
    "role": "Team Member",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Dead end job, poor management, favoritism, exploitation",
    "description": "Favoritism and being popular is a big thing here. If you have family who are leads or in HR they’ll schedule you more and give the rest of us less hours than them even if you’re a great worker. Poor management, bad pay, you can work your heart and soul",
    "date": "June 16, 2025",
    "role": "Target Sales Associate",
    "location": "West Covina, CA",
    "company": "target"
  },
  {
    "title": "They will have unrealistic expectations of you",
    "description": "They push too hard. You will try as hard as you can to do everything they want and more, yet it still isn’t good enough. I got super sick within my first 90 days and had to call off a few days as I was in the hospital. From that point on, mgmt made",
    "date": "June 16, 2025",
    "role": "General Merchandise Expert",
    "location": "Lewis Center, OH",
    "company": "target"
  },
  {
    "title": "nice",
    "description": "decent, worked here for long time.good for first or second job. was guest advocate and cashier. drive ups were alot in heat though. i recommend if ur young",
    "date": "June 16, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "Avoid if you can.",
    "description": "What is the best part of working at the company?",
    "date": "June 16, 2025",
    "role": "Custodial Worker",
    "location": "Duarte, CA",
    "company": "target"
  },
  {
    "title": "Target was a fantastic job for a majority of my time there, but dropped off in quality.",
    "description": "Target was a fantastic job for a majority of my time there, but at a point the amount of hours I got dropped to a heavily suspicious 6 per month.  I've talked to my manager and store lead about it to little success.  There's quite a few benefits to",
    "date": "June 16, 2025",
    "role": "Front of Store Attendant",
    "location": "Spokane, WA",
    "company": "target"
  },
  {
    "title": "Fun and engaging workplace",
    "description": "I have worked at 2 Targets as a barista and both have helped me grow confidence in social skills. The best parts were to engage in customer service and connections, staff is fun and it’s exciting to craft new drinks. The cons of working as a barista",
    "date": "June 16, 2025",
    "role": "Barista",
    "location": "N/A",
    "company": "target"
  },
  {
    "title": "People Lead",
    "description": "Working at Target as a People Lead was a fast-paced but rewarding experience. No two days were the same — my daily responsibilities ranged from supporting team member scheduling and payroll, to leading new hire orientations and helping resolve HR or",
    "date": "June 16, 2025",
    "role": "People Lead",
    "location": "Rogers, AR",
    "company": "target"
  }
]